[
  {
    "id": "cloud-resume-multicloud",
    "title": "Cloud Resume Challenge - Multi Cloud (AWS & Azure)",
    "subtitle": "Infrastructure as Code | Serverless | CI/CD",
    "year": "2025",
    "status": "in-progress",
    "featured": true,
    "excerpt": "Built a fully serverless resume website with visitor counter",
    "technologies": "AWS (S3, CloudFront, Lambda, API Gateway, DynamoDB, Route 53, ACM), Terraform, Python, GitHub Actions",
    "githubUrl": "https://github.com/fazabillah/cloud-resume-challenge",
    "liveUrl": null,
    "body_html": "<h2>Summary</h2>\n<p>Built a fully serverless resume website with visitor counter, demonstrating end-to-end cloud engineering capabilities.</p>\n<h2>Key Features</h2>\n<ul>\n<li><strong>Frontend:</strong> Static website (HTML/CSS/JS) hosted on S3, distributed via CloudFront with custom domain and SSL/TLS certificate</li>\n<li><strong>Backend:</strong> Python Lambda function with DynamoDB for visitor counter, exposed via API Gateway</li>\n<li><strong>IaC:</strong> Complete infrastructure provisioned using Terraform with modular, reusable code</li>\n<li><strong>CI/CD:</strong> Automated deployment pipeline using GitHub Actions for both frontend and backend</li>\n<li><strong>Testing:</strong> Implemented Python unit tests and integration tests for Lambda function</li>\n</ul>\n<h2>Architecture</h2>\n<p>Frontend hosted on S3 with CloudFront distribution. Backend serverless Lambda with DynamoDB. API Gateway for REST endpoints.</p>\n<h2>Challenges</h2>\n<p>Implementing visitor counter with DynamoDB, setting up CI/CD with GitHub Actions.</p>\n<h2>Key Learnings</h2>\n<p>Serverless architecture benefits, Infrastructure as Code best practices.</p>"
  },
  {
    "id": "genai-contract",
    "title": "Gen-AI RAG Contract Document Analyzer",
    "subtitle": "Generative AI | Document Analysis | NLP",
    "year": "2025",
    "status": "completed",
    "featured": false,
    "excerpt": "Intelligent contract document analysis system using RAG",
    "technologies": "Python, LangChain, NLTK, Vector DB, RAG, Document AI",
    "githubUrl": null,
    "liveUrl": null,
    "body_html": "<h2>Summary</h2>\n<p>Built an intelligent contract document analysis system using RAG to extract key information, clauses, and obligations from legal documents.</p>\n<h2>Key Features</h2>\n<ul>\n<li><strong>Document Processing:</strong> Automated extraction and indexing of contract terms</li>\n<li><strong>RAG Implementation:</strong> Context-aware question answering for contract analysis</li>\n<li><strong>NLP Features:</strong> Entity recognition, clause extraction, and semantic search</li>\n<li><strong>User Interface:</strong> Interactive query system for contract insights</li>\n</ul>\n<h2>Architecture</h2>\n<p>Document ingestion pipeline, RAG system with semantic search, interactive UI.</p>\n<h2>Challenges</h2>\n<p>Handling diverse document formats, ensuring extraction accuracy.</p>\n<h2>Key Learnings</h2>\n<p>Document processing, legal document understanding, RAG optimization.</p>"
  },
  {
    "id": "genai-corrosion",
    "title": "Gen-AI RAG Corrosion Consultant ChatBot",
    "subtitle": "Generative AI | RAG | Machine Learning",
    "year": "2025",
    "status": "completed",
    "featured": false,
    "excerpt": "AI-powered corrosion consultant chatbot App using Retrieval-Augmented Generation",
    "technologies": "Python, LangChain, Huggingface, Vector DB, RAG, FastAPI",
    "githubUrl": "https://github.com/fazabillah/corrosion-AI-tools",
    "liveUrl": null,
    "body_html": "<h2>Summary</h2>\n<p>Developed an AI-powered corrosion analysis platform using Retrieval-Augmented Generation (RAG) architecture for intelligent document querying and technical insights.</p>\n<h2>Key Features</h2>\n<ul>\n<li><strong>AI Architecture:</strong> RAG implementation with vector database for context-aware responses</li>\n<li><strong>ML Pipeline:</strong> LangChain integration for document processing and query handling</li>\n<li><strong>Domain Expertise:</strong> Specialized corrosion engineering knowledge base</li>\n<li><strong>API Development:</strong> RESTful endpoints for AI-powered analysis</li>\n</ul>\n<h2>Architecture</h2>\n<p>RAG system with vector embeddings, LLM for generation, API backend.</p>\n<h2>Challenges</h2>\n<p>Fine-tuning RAG for domain-specific accuracy, managing embeddings at scale.</p>\n<h2>Key Learnings</h2>\n<p>RAG architecture, vector databases, domain-specific AI applications.</p>"
  }
]